Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་གཡོ་བ་ནི་མི་རྣམས་ཀྱི་ལུས་མི་གཡོ་བ་ཡང་རྐང་པ་དང་། ལག་པ་ལ་སོགས་པ་འགུལ་བ་བཞིན་དུ་ཕྱོགས་གཅིག་གཡོ་བས་ན་གཡོ་བ་ཞེས་བྱའོ།
en: Just as the human body does not shake, but still the legs and the arms and so on quake, so too there is shaking when a region stirs.

source: །མི་དེ་ཉིད་འཁོར་ལོ་འཁོར་བ་བཞིན་དུ་དཀྱིལ་འཁོར་ཡོངས་སུ་འཁོར་བ་ལ་འགུལ་གཡོ་བ་ཞེས་བྱའོ།
en: That same person [who has a human body] turns like a turning wheel. Like that, when the whole disk rotates it is quaking.

source: །རླུང་གི་ཤུགས་ཀྱིས་ཤིང་ལྡེག་པ་བཞིན་དུ་ཐམས་ཅད་ཀྱི་བདག་ཉིད་ཀྱིས་ལྡེག་པ་ལ་ལྡེག་པ་ཞེས་བྱའོ།
en: With the force of wind, the trees stir. Like that, when everything stirs on its own it is stirring.

source: །དེ་དག་རེ་རེ་ལ་ཡང་རྣམ་པ་གསུམ་སྟེ། ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོའོ།
en: Each of those is subdivided into three: small, middling, and large.

source: །དེ་ལ་དང་པོ་ནི་དལ་བུས་གཡོས་སོ། །དེ་ནས་དེ་བས་དྲག་ཏུ་རབ་ཏུ་གཡོས་སོ། །དེ་ནས་དེ་བས་ཀྱང་ལྷག་པར་ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ།
en: Of them, first there is a gentle shaking, then one more forceful than that, a great shaking, then one even more forceful than that, a violent shaking.

source: །དེ་ནས་དེའི་འོག་ཏུ་ཧ་ཅང་མི་མྱུར་བར་འགུལ་ཏོ། །དེའི་འོག་ཏུ་མྱུར་བར་མྱུར་དུ་རབ་ཏུ་འགུལ་ལོ། །དེའི་འོག་ཏུ་ཤིན་ཏུ་མྱུར་བར་རྒྱུན་རིང་བར་ཀུན་ཏུ་རབ་ཏུ་འགུལ་ལོ།
en: Then, after that there is a quaking, but not rapidly, then more rapidly, a great quaking, and after that very rapidly and for a long time, a violent quaking.

source: །དེ་ལྟར་སྦྱར་ཞིང་བཤད་པར་བྱའོ། །དེ་ནས་གང་གི་ཚེ་ཁོར་ཡུག་དང་།
en: You should apply and explain them like that.

source: ཁོར་ཡུག་ཆེན་པོ་ལ་སོགས་པ་མཐའི་རི་རྣམས་གྱེན་དུ་འཕགས་ཏེ། མཐོན་པོར་གྱུར་ཅིང་དབུས་ཀྱི་སོ་ན་གནས་པ་དེའི་ཚེ་ནི་མཐའ་མཐོ་ན་ནི་དབུས་དམའ་བར་གྱུར་ཏོ། །གང་གི་ཚེ་དབུས་གྱེན་དུ་མཐོན་པོར་གྱུར་ཅིང་། རི་རྣམས་སོ་ན་གནས་པར་གྱུར་པ་དེའི་ཚེ་ནི། དབུས་མཐོ་ན་ནི་མཐའ་དམའ་བར་གྱུར་ཏོ།
en: Then, when the mountains at the edges—the girdle of mountains, the great encircling girdle of mountains, and so on—became elevated and the middle remained as it was, the edges rose up while the middle sank; when the middle became elevated and the mountains remained as they were, the middle rose up while the edges sank.

source: །འཇམ་པ་དང་། སྣུམ་པ་དང་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་བསྐྱེད་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ནི་ངོ་མཚར་སྐྱེད་པའི་ཕྱིར་ཏེ། རི་ཆེན་པོ་ལ་སོགས་པ་ནི་འཇམ་པར་གྱུར་ཏོ། །ཤིང་གི་ཡན་ལག་ལ་སོགས་པ་ཐམས་ཅད་ནི་སྣུམ་པར་གྱུར་ཏོ། །རླུང་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་བསྐྱེད་པར་གྱུར་ཏོ་ཞེས་བྱ་བར་སྦྱར་རོ།
en: It then says it became soft and oily, producing ease for all beings, that is, produced amazement: the huge mountains and so on became soft; all the branches of the trees and so on became oily; the wind made all beings feel at ease.

source: །དེ་ནས་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་གདགས་པའི་ཕྱིར། སེམས་ཅན་དམྱལ་བ་ལ་སོགས་པ་རྒྱུན་ཆད་པར་གྱུར་ཅེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Construe it like that. Helping the world of inhabitant beings Then, because it was a benefit for all worlds, it says the continuum of the hells and so on was cut, and so on.

source: །མི་ཁོམ་པ་ཐམས་ཅད་ཀྱང་མེད་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ལ་སོགས་པ་དང་།
en: It also says all the places that preclude a perfect human birth disappeared and so on.

source: སྐབས་ཡོད་པ་དང་དལ་བ་རྣམས་ནི་དོན་ཐ་དད་པ་མ་ཡིན་ཏེ། མངོན་པར་རྟོགས་པའི་སྐབས་མེད་པས་ན་མི་ཁོམ་པ་ཞེས་བྱའོ། །དེ་དག་ཀྱང་རྣམ་པ་བརྒྱད་དེ། སེམས་ཅན་དམྱལ་བར་སྐྱེས་པ་དང་།
en: The meaning of a good situation and the freedoms is the same because “places that preclude a perfect human birth” are situations precluding clear realization.

source: དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་དང་{ཡི་དགས་,ཡི་དྭགས་}སུ་སྐྱེས་པ་དང་། མཐའ་འཁོབ་ཀྱི་ཀླ་ཀློར་སྐྱེས་པ་དང་། གཟུགས་མེད་པ་དང་། འདུ་ཤེས་མེད་པའི་སྲིད་པར་སྐྱེས་པ་དང་། དམུས་ལོང་དང་། འོན་པ་དང་།
en: There are, furthermore, eight of these: birth in hell; birth as an animal; birth as a ghost; birth as a barbarian in a border area; birth in a formless and thought-free existence; birth as a blind, deaf, or mute person and so on; birth with a wrong view; and birth during an eon when there is no buddha.

source: ལྐུགས་པ་ལ་སོགས་པར་གྱུར་པ་དང་། ལོག་པར་ལྟ་བར་གྱུར་པ་དང་། སངས་རྒྱས་མེད་པའི་བསྐལ་པ་ལ་སྐྱེས་པ་རྣམས་སོ། །དེ་ལ་གཟུགས་མེད་པ་དང་། འདུ་ཤེས་མེད་པའི་སྲིད་པ་ཇི་ལྟར་མེད་པར་གྱུར་ཅེ་ན།
en: How does birth in a formless and thought-free existence disappear?

source: དེར་སྐྱེ་བར་འགྱུར་བ་རྣམས་སྐད་ཅིག་དེ་ཉིད་ལ་སྐྱེ་བ་མི་ལེན་པའི་ཕྱིར་དེ་ཡང་མི་ཁོམ་པ་མེད་པ་ཞེས་བྱའི།
en: Those reborn in just that place that does not preclude a perfect human birth are not born there. Therefore they are also “places precluding a perfect human birth.” They have “disappeared.”

source: རྒྱུན་ཆད་པར་གྱུར་པ་ཉིད་ནི་མ་ཡིན་ནོ།
en: It is not that their continuum has been cut.

source: །འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མིག་ལ་སོགས་པ་ཐོབ་པ་འདི་ནི་སངས་རྒྱས་རྣམས་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་གྱུར་པའོ།
en: That all the beings acquire eyes and so on in this way comes about through the power of the previous prayers of the buddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ་ཞེས་བྱ་བ་ལ་དགྱེས་པས་བསྐྱོད་པའི་ཚིག་ནི་ཆེད་དུ་བརྗོད་པ་ཞེས་བྱ་སྟེ།
en: It says the lord buddhas in other buddhafields cried out cries of delight. “Cries of delight” (udāna) are words stirred by delight.

source: དཔེར་ན་ཆེད་དུ་འབྱུང་བའི་རླུང་དབང་མེད་པར་འབྱུང་བ་དེ་བཞིན་དུ་ཆོས་མངོན་པར་འཕེལ་བའི་ཤུགས་ཀྱིས་དགྱེས་པས་བསྐྱོད་པའི་ཚིག་ནི་ཆེད་དུ་འབྱུང་བ་དང་འདྲ་བས་ཆེད་དུ་བརྗོད་པ་ཞེས་བྱའོ། །སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནི་ཤིན་ཏུ་མི་བརྩོན་པ་དང་། དམན་པ་དང་། ངན་འགྲོར་སྐྱེས་པ་རྣམས་ལ་ཡང་དེ་ལྟ་བུའི་ཤེས་རབ་མཆོག་ཏུ་གྱུར་པ་ཡང་དག་པར་འབྱུང་བར་གཟིགས་ནས། ཨེ་མའོ།
en: To illustrate, just as the upward-rising vital wind (udāna) comes out involuntarily, similarly, words stirred through delight in the increase in Dharma are caused to rise up, as it were, so they are “cried out.”

source: །སངས་རྒྱས་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་མཛད་པའི་ཚེ་ན་དུལ་བ་དང་། ཞི་བ་དང་། ཡང་དག་པར་སྡོམ་པ་དང་། ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་ལ་སོགས་པ་ནི་རྨད་དུ་བྱུང་བ་སྟེ། དེ་དག་ཡོངས་སུ་བསྔོས་པའི་སྟོབས་ཀྱིས་འདི་ལྟ་བུར་དམན་པ་འདི་དག་ཀྱང་ཤེས་རབ་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏོ་ཞེས་ཆེད་དུ་བརྗོད་པར་གྱུར་ཏོ།
en: Seeing in this buddhafield that the lazy, the disadvantaged, and those born in states of woe have become perfectly endowed with such excellent knowledge, “Ah!”—the buddhas “cried out cries of delight” that the self-discipline, calming, restraint, observance of celibacy, and so on, engaged in when they themselves were bodhisattvas, are amazing, because through the force of dedicating them, even those who are disadvantaged like that have become endowed with such knowledge.

source: །དུལ་བ་ཞེས་བྱ་བ་ནི་དབང་པོ་བསྡམས་པའོ། ཞི་བ་ཞེས་བྱ་བ་ནི་ཏིང་ངེ་འཛིན་ལ་སོགས་པས་ཉོན་མོངས་རྣམས་ཞི་བར་བྱའོ། །ཡང་དག་པར་སྡོམ་པ་ཞེས་བྱ་བ་ནི་གསོ་སྦྱོང་ལ་སོགས་པའི་སྡོམ་པའོ། །ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་ཞེས་བྱ་བ་ནི་དགེ་སློང་གི་དངོས་པོ་ལ་སོགས་པའི་སྡོམ་པའོ། །སྲོག་ཆགས་འབྱུང་པོ་རྣམས་ལ་རྣམ་པར་མི་འཚེ་བ་ནི་ལེགས་པའོ་ཞེས་བྱ་བ་ནི་བྱམས་པ་ལ་སོགས་པ་སྒོམ་པའོ། །དབང་པོ་བསྡམས་པའི་འབྲས་བུ་ནི།
en: Self-discipline is restraint of the sense faculties; “calming” is the calming of afflictive emotions with meditative stabilization and so on; restraint is being bound by the code of the confession and restoration observance; to observe celibacy is to exercise restraint where it is expected of a monastic and so on; and nonviolence toward living creatures is to cultivate love and so on.

source: དམུས་ལོང་དང་། འོན་པ་དང་། ལྐུགས་པ་ལ་སོགས་པ་མེད་པར་གྱུར་པའོ། །ཏིང་ངེ་འཛིན་ལ་སོགས་པའི་འབྲས་བུ་ནི་སྨྱོན་པ་རྣམས་ཀྱང་དྲན་པ་ཐོབ་པར་གྱུར་ཏོ། །སེམས་འཁྲུགས་པ་རྣམས་ཀྱང་འཁྲུག་པ་མེད་པའི་སེམས་ཐོབ་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ལ་སོགས་པའོ།
en: The result of restraint of the sense faculties is that there are no people who are blind, deaf, dumb, and so on; the result of meditative stabilization and so on is that the insane regained their senses, those with distracted thoughts became one-pointed in their thoughts, and so on.

source: །གསོ་སྦྱོང་ལ་སོགས་པའི་སྡོམ་པའི་འབྲས་བུ་ནི་གོས་མེད་པ་རྣམས་ཀྱང་གོས་ཐོབ་པར་གྱུར་ཏོ། །དབུལ་པོ་རྣམས་ཀྱང་ནོར་ཐོབ་པར་གྱུར་ཏོ། །བཀྲེས་པ་རྣམས་ཀྱང་ཟས་ཐོབ་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ལ་སོགས་པའོ།
en: The result of being bound by the code of the confession and restoration observance and so on is that the naked found clothes, the poor found wealth, the hungry found food and so on.

source: །ཚངས་པར་སྤྱོད་པ་ལ་གནས་པའི་འབྲས་བུ་ནི་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་སྤངས་ནས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་ཏེ། དྲི་ང་བ་མེད་པ་ལ་སོགས་པའོ།
en: The result of observing celibacy is giving up the ten unwholesome paths of action and completing the ten wholesome paths of action and hence being free from stain and so on.

source: །བྱམས་པ་ལ་སོགས་པ་བསྒོམས་པའི་འབྲས་བུ་ནི་ཕ་མ་དང་མཚུངས་པའི་སེམས་ལ་སོགས་པ་དང་། ཚོགས་པའི་བདེ་བ་ཐོབ་པ་དང་། ཤེས་རབ་ཐོབ་པའོ། །འོད་དང་། སྐུ་མདོག་དང་།
en: The result of cultivating love and so on is they considered every being in the same way as they considered their mother, father and so on, gained ease in assemblies, and gained knowledge.

source: གཟི་བརྗིད་དང་། དཔལ་གྱིས་ཞེས་བྱ་བ་ལ། འོད་ནི་སྣང་བ་དང་། འབར་བའོ། །སྐུ་མདོག་ནི་པགས་པ་མཛེས་པའོ།
en: When it says his light, color, brilliance, and glory, it is that his light is shining and blazing, the color is of his beautiful skin, the brilliance his force, and glory his pleasing shape and so on.

source: །གཟི་བརྗིད་ནི་མཐུའོ། །དཔལ་ནི་དབྱིབས་ལ་སོགས་པ་སྡུག་པའོ། །ཟིལ་གྱིས་མནན་ཏེ་མཛེས་ཤིང་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེའོ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་བརྗོད་ཅེ་ན།
en: Why does it say “towering over… shining forth, gleaming, dazzling, and shedding light”?

source: དེ་བཞིན་གཤེགས་པས་དེའི་ཚེ་ཆོས་བཤད་པ་ལ་གུས་པ་བསྐྱེད་པའི་ཕྱིར་དེ་ལྟ་བུའི་རྒྱ་ཆེན་པོ་བསྟན་དུ་སྙམ་དུ།
en: At that time, the Tathāgata thinks about such a great spectacle to produce respect for the Dharma discourse.

source: དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བློ་དེ་ལྟ་བུ་བསྐྱེད་པའི་ཕྱིར་དེ་སྐད་བརྗོད་དོ་ཞེས་དགོངས་པའོ།
en: The idea is that this is said because at that time such an attitude is produced in the minds of all beings.

source: །འོད་ཀྱིས་ཟིལ་གྱིས་མནན་པས་མཛེས་སོ། །སྐུ་མདོག་གིས་ཟིལ་གྱིས་མནན་པས་ལྷམ་མེའོ། །གཟི་བརྗིད་ཀྱིས་ཟིལ་གྱིས་མནན་པས་ལྷན་ནེའོ།
en: Towering over with light he is shining forth; towering over with color he is gleaming; towering over with brilliance he is dazzling; and towering over with glory he is shedding light.

source: །དཔལ་གྱིས་ཟིལ་གྱིས་མནན་པས་ལྷང་ངེའོ། །འོད་ཀྱིས་ནི་ཚངས་པ་ཟིལ་གྱིས་མནན་ཏེ། དེ་དག་འོད་སྙེམས་པའི་ཕྱིར་རོ།
en: As for with his light, he towers over the Brahmās because they feel proud of their light.

source: །སྐུ་མདོག་གིས་ནི་ལྷ་རྣམས་ཟིལ་གྱིས་མནན་ཏོ། །གཟི་བརྗིད་ཀྱིས་ནི་བདུད་ཀྱི་རིས་དང་མུ་སྟེགས་ཅན་རྣམས་ཟིལ་གྱིས་མནན་ཏོ། །དཔལ་གྱིས་ནི་མི་རྣམས་ཟིལ་གྱིས་མནན་ཏོ།
en: With color he towers over the gods; with brilliance he towers over the classes of Māras and tīrthikas; and with glory he towers over humans.

source: །དེའི་འོག་ཏུ་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་སྟོན་ཏེ།
en: Next is the demonstration of miraculous wonder-working powers.

source: དེ་ཡང་སྤྲུལ་པའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་སྟོན་ཏོ།
en: The demonstration, furthermore, is of the miraculous wonder-working power by means of magical creation.

source: །དེ་དང་མཐུན་པར་སྐུ་ཐ་མལ་པ་བསྟན་ཏོ་ཞེས་བྱ་བ་ལ། འཁོར་ཡུག་བྱེ་བ་ཕྲག་བརྒྱའི་ནང་འདི་ན་ཚངས་པའམ། ལྷ་འམ། བདུད་དམ། མི་རྣམས་གང་ཡང་རུང་བའི་མདུན་ན་དེ་བཞིན་གཤེགས་པ་མི་སྣང་བའི་སེམས་ཅན་སྐལ་བ་དང་མི་ལྡན་པར་གྱུར་པ་གཅིག་ཀྱང་མེད་དེ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Thereupon the Lord exhibited an ordinary bodily form, like that of… This means there was not even a single unfortunate being within this encircling range of a billion mountains, no Brahmā, god, Māra, or human, in front of whom the Tathāgata did not appear. “

source: །དེ་དང་མཐུན་པ་ཞེས་བྱ་བ་ནི་བག་ཕེབས་པར་བྱ་བའི་ཕྱིར་དེ་དང་དེ་དག་གི་མདུན་དུ་དེ་དག་གི་ལུས་ཀྱི་ཚད་བཞིན་དུ་སྣང་བར་གྱུར་ཏོ།
en: Like that of…” means that, to set them at ease, he appeared in front of them the same size as they were.

source: །སྐུ་ཐ་མལ་པ་ཞེས་བྱ་བ་ནི་རང་བཞིན་གྱི་སྐུ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: An “ordinary bodily form” means a “natural bodily form.”

source: །རང་བཞིན་གྱི་སྐུ་ཞེས་བྱ་བ་འདི་ཡང་ཇི་ལྟ་བུ་ཞེ་ན།
en: What sort of natural bodily form is it?

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་བས་ཆོག་མི་ཤེས་པའོ།
en: It is the body of the Tathāgata you can never see enough.

source: །བལྟ་བས་ཆོག་མི་ཤེས་པའི་སྐུ་ཞེས་བྱ་བ་ཇི་ལྟ་བུ་ཞེ་ན།
en: And what is “the body of the Tathāgata you can never see enough”?

source: མི་དང་ལྷ་རྣམས་ཀྱི་མདོག་དང་ཡང་མི་འདྲ་ལ། འཇིག་རྟེན་ན་ཡང་དེ་དང་འདྲ་བའི་དངོས་པོ་ཅུང་ཟད་ཀྱང་མེད་པ་དེ་ལྟ་བུའི་སྐུ་མདོག་དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་གྱི་སྐུ་ལ་མངའ་བའོ།
en: The body of the Tathāgata is one whose color is unlike the color of human or celestial bodies; it is one whose color is unlike anything that exists anywhere in the world.

source: །མདོག་ཏུ་སྣང་ཡང་བདག་ཅག་གི་ལུས་ཀྱི་མདོག་ལྟ་བུ་ནི་མ་ཡིན་ནོ་ཞེས་ཐམས་ཅད་ཀྱིས་ཤེས་ཤིང་།
en: Everybody understands that even though its color appears, it is not like the color of their own bodies.

source: དེ་བཞིན་དུ་ཤ་དང་རུས་པ་དང་། སྐྲ་དང་སེན་མོ་རྣམས་ཀྱང་ཡོད་ལ། སེམས་ཅན་གཞན་ཐམས་ཅད་དང་འདྲ་བ་ནི་མ་ཡིན་ཏེ། དེ་ལྟ་དེ་ལྟར་སྣང་ཡང་།
en: And so too with the flesh, bones, hair, and nails—they are not like those of other beings.

source: འཇིག་རྟེན་པ་ཐམས་ཅད་དོགས་པ་ཡང་སྐྱེའོ།
en: Even though they appear similarly, all ordinary beings are unsure.

source: །དེ་ལྟར་ན་སྐུ་དེ་སྐུའི་བདག་ཉིད་དུ་ཡོད་ལ་དེ་ལྟར་སྣང་ཞིང་འཇིག་རྟེན་པ་དག་དོགས་པར་གྱུར་ཀྱང་དངོས་པོ་ཅི་ཡིན་པ་སུས་ཀྱང་མི་ཤེས་སོ།
en: That body thus appears to be a body, but ordinary persons are not sure what kind of thing it is.

source: །དེ་ལྟར་དབྱིབས་དང་གཟུགས་ལ་སོགས་པ་ཐམས་ཅད་ཀྱི་ལུས་དང་འདྲ་ཡང་རང་བཞིན་མི་ཤེས་ཤིང་། ཤིན་ཏུ་འབར་བའི་ཤིན་ཏུ་རྒྱ་ཆེ་བའི་སྐུ་ནི་བལྟ་བས་ཆོག་མི་ཤེས་པ་ཞེས་བྱ་སྟེ། ཡང་ན་རྡོ་རྗེའི་རང་བཞིན་ནམ། གསེར་དང་། ནོར་བུ་དང་།
en: So, this extremely radiant and vast body, a body similar to all other bodies in shape and color and so forth but whose nature is not known, “can never be seen enough.”

source: མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་ལ་སོགས་པའི་རང་བཞིན་ནམ། མིའི་ལུས་སུ་གཏོགས་པ་འམ། ལྷ་དང་ཚངས་པའི་ལུས་སུ་གཏོགས་པ་འམ། ལུས་སུ་གཏོགས་པ་མ་ཡིན་པ་ཤེས་ཀྱང་ཇི་ལྟར་ཡང་ཤེས་པར་མི་ནུས། གང་དུ་ཡང་བསྡུ་བ་འམ།
en: Furthermore, even if it is known to have the nature of a diamond, the nature of gold, jewel, pearl, or beryl and so on, or that it is in the class of human bodies, in the class of celestial or Brahmā bodies, or not even classifiable as a body, still it cannot be known how, and it cannot be categorized or reckoned.

source: བགྲང་བར་མི་ནུས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That is the meaning.

source: །བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་སྟེང་གི་ནམ་མཁའ་ལ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་བྱིན་གྱི་རླབས་ཀྱིས་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་བསྟན་ཏོ།
en: By the sustaining power of the Lord… in the sky right above the Lord’s head, and so on, teaches wonder-working by means of sustaining power.

source: །ཡང་འཛུམ་པ་མཛད་དེ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་འཇིག་རྟེན་གྱི་ཁམས་ན་གནས་པ་རྣམས་གཅིག་ལ་གཅིག་སྣང་བར་བྱ་བ་དང་། འཁོར་བསྡུ་བར་བྱ་བའི་ཕྱིར་ཆོས་སྣང་བའི་ཆོ་འཕྲུལ་བསྟན་ཏེ།
en: Smiled once again and so on demonstrates the miraculous dharma-illuminating powers, so those standing in different world systems will be illuminated for each other, and in order to assemble a retinue.

source: དགའ་བ་དང་། མགུ་བ་དང་། དད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་རོ།
en: It is so that they will be pleased, delighted, and have faith.

source: །ཀུན་གྱི་ཕ་རོལ་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་ཅན་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པའི་ཕྱིར་འདིར་ལྷགས་པ་རྣམས་ཀྱི་མཐའ་ལ་ཀུན་གྱི་ཕ་རོལ་ཞེས་བྱ་བར་གཟུང་ངོ་།
en: At the very limit… there is a world system called Ratnāvatī. World systems are limitless, so take “at the very limit” as the limit on account of those adjacent to it.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་མཐའ་བསྟན་པས་དེའི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་བཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཤེགས་པར་བསྟན་པ་ཡིན་ནོ།
en: By teaching the limit of all world systems, it teaches that the bodhisattvas standing in all the world systems up to that one come to see Śākyamuni.

source: །ཐམས་ཅད་ཅིའི་ཕྱིར་མ་གཤེགས་ཤེ་ན།
en: Why don’t all of them come?

source: གང་དག་བྱོན་པར་བྱ་བའི་དགོས་པ་འགའ་ཡོད་པར་གྱུར་པ་དེ་དག་ལ་ནི་སངས་རྒྱས་ཀྱི་འོད་ཟེར་གྱིས་སྣང་བར་མཛད་ཀྱིས།གཞན་དག་ལ་ནི་མ་ཡིན་པའི་ཕྱིར་རོ།
en: It is because the radiance of the Buddha illuminates those for whom there is a purpose in coming, not others.

source: །དེ་དག་ཀྱང་བདག་ཅག་གི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའ་མཛད་པའི་ཚེ་ན། དེ་བཞིན་གཤེགས་པ་དང་ལྷན་ཅིག་ཏུ་སྨོན་ལམ་གྱི་བསྡུ་བ་ལ་སོགས་པས་བྱ་བ་བྱས་པ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་སྐྱེས་སུ་ཟིན་ཀྱང་། བདག་ཅག་གི་དེ་བཞིན་གཤེགས་པས་འདུལ་བ་ཡིན་པས། འོད་ཟེར་གྱི་ཕོ་ཉ་རྣམས་ཀྱིས་དེ་དག་ཡང་དག་པར་བསྐུལ་བ་བྱས་པར་བསྟན་པ་ཡིན་ནོ།
en: This teaches that radiance-messengers exhort those who, when our Tathāgata was a bodhisattva, made a prayer that is a vow together with the Tathāgata and so on, even if they have been born in other buddhafields, because they are trainees of our Tathāgata.

source: །བཞུགས་ཤིང་འཚོ་གཞེས་ཏེ་ཞེས་བྱ་བ་ལ་ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པའི་ཕྱིར་སྲོག་གི་དབང་པོ་རྒྱུན་ལ་བཞུགས་པ་ཞེས་བྱའོ། །སྐུ་ལས་བྱུང་བའི་བསྙུན་མི་མངའ་བའི་ཕྱིར་འཚོ་ཞེས་བྱའོ། །གློ་བུར་གྱི་བསྙུན་མི་མངའ་ཞིང་དུས་ཀྱི་བར་དུ་བཞུགས་པས་ན་གཞེས་པ་ཞེས་བྱའོ།
en: As for stands, stays, and maintains himself, that is to say, because [Ratnākara] has not passed into complete nirvāṇa, his life-faculty continuum remains; because he has no physical sicknesses he “stays”; and he “maintains himself” because he has no sudden sicknesses and lives out his span.

source: །ཡང་ན་ཆོས་ཀྱི་སྐུ་ནི་གནས་པ་ཡིན་པའི་ཕྱིར་བཞུགས་པ་ཞེས་བྱའོ། །ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ནི་འཚོའོ།
en: Alternatively, because it persists, the dharma body “stands”; the complete enjoyment body “stays”; and the magically created body “maintains itself.”

source: །སྤྲུལ་པའི་སྐུ་ནི་གཞེས་སོ། །ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱ་བ་ལ་གཞོན་ནུར་གྱུར་པ་ཡང་ཚངས་པར་སྤྱོད་པའི་དབང་དང་། སའི་དབང་གིས་རྣམ་པ་གཉིས་ཏེ།
en: For the most part in the form of the young— there are two sorts of those “in the form of the young”: those based on celibacy and those based on the Bodhisattva level.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་རང་བཞིན་གྱིས་ཉོན་མོངས་པ་ཆུང་བ་དག་ནི། དང་པོ་སེམས་བསྐྱེད་པ་ནས་བཟུང་སྟེ་ཚངས་པར་སྤྱོད་པ་ཉིད་ཀྱིས། ས་བཅུ་པའི་བར་ལ་གནས་པར་གྱུར་པ་དེ་དག་ཀྱང་གཞོན་ནུར་གྱུར་པ་ཉིད་དོ།
en: Those bodhisattvas who naturally have fewer defilements and are celibate, starting from their first production of the thought of awakening up to when they stand on the tenth level, are “in the form of the young.”

source: །ས་བརྒྱད་པ་ཡང་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱ་སྟེ། ས་དེ་ཐོབ་པས་རྩོལ་བ་དང་། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱའོ།
en: Those on the eighth level are also “in the form of the young”—because those who reach that level are free from all effort and conceptualization, they are “in the form of the young.”

source: །པདྨ་བསྐུར་ཏེ་ཞེས་བྱ་བ་ལ་ཅིའི་ཕྱིར་སངས་རྒྱས་རྣམས་པདྨའི་མཆོད་པ་བསྐུར་ཞིང་བསྙུན་ཀྱང་གསོལ་ཞེ་ན།
en: As for gave… lotuses, why do buddhas give offerings of lotuses and why do they inquire about health?

source: འདི་ནི་སངས་རྒྱས་རྣམས་ཀྱི་ཀུན་རྫོབ་ཀྱི་ཐ་སྙད་དེ།
en: This is the conventional custom of buddhas.

source: ཡང་དད་པའི་རྗེས་སུ་འབྲང་བའི་འཇིག་རྟེན་གྱིས་དེ་མཐོང་ངམ་ཐོས་ན།
en: When ordinary faith-followers see and hear this they feel a serene confidence: “Ah!

source: ཨེ་མའོ་འདི་ལྟར་ང་རྒྱལ་དང་ཕྲག་དོག་མི་མངའོ་ཞེས་རབ་ཏུ་དད་པར་འགྱུར་བ་དང་།
en: They are without arrogance and envy.”

source: སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ན་ཡང་སངས་རྒྱས་རྣམས་བཞུགས་པར་ཤེས་པར་བྱ་བའི་ཕྱིར་རོ།
en: And it lets them know there are buddhas who stand in other buddhafields as well.

source: །སློབ་དཔོན་དག་ནི་འདི་སྐད་དུ་འདི་དག་ནི་གདུལ་བར་གྱུར་པ་ཡིན་གྱི།
en: The masters say, “They are disciplined, but not fully accomplished.

source: ཡོངས་སུ་གྲུབ་པ་མ་ཡིན་པས་བྱང་ཆུབ་སེམས་དཔའ་དང་དེའི་འཁོར་རྣམས་གདུལ་བ་ཉིད་ཡིན་པར་ཤེས་པར་བྱ་བའི་ཕྱིར་པདྨ་བསྐུར་བ་ཡིན་ནོ་ཞེས་འཆད་དོ།
en: He dispatches the lotuses so it will be known that the bodhisattva and his retinue are in fact trainees.”

source: །དེ་བས་ན་འདི་དག་ལེགས་པར་ཡོངས་སུ་གྲུབ་པ་མ་ཡིན་པའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བག་ཡོད་པར་སྤྱོད་ཅིག་ཅེས་རྗེས་སུ་བསྟན་པ་ཡིན་ཏེ་དེ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་ཉོན་མོངས་པའི་སྙིགས་མ་དང་།
en: So, because they are not perfectly, fully accomplished, he gives the instruction, “Child of a good family, be careful in that buddhafield.”

source: དུས་ཀྱི་སྙིགས་མ་དང་། ཚེའི་སྙིགས་མ་དང་། ལྟ་བའི་སྙིགས་མ་དང་། སེམས་ཅན་གྱི་སྙིགས་མ་དང་། སྙིགས་མ་ལྔ་ཡོད་པའི་ཕྱིར་དེ་སྐད་དུ་བཀའ་སྩལ་ཏོ།
en: Furthermore, he says this because there are five degenerations in this buddhafield: degeneration because of afflictions, degeneration because of the time in the eon, degeneration in lifespan, degeneration in views, and degeneration in beings.

source: །དེ་ལ་ཉོན་མོངས་པའི་སྙིགས་མ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ལ་སོགས་པ་མང་ཞིང་ཆེར་འབྱུང་སྟེ།
en: Among these, degeneration because of afflictions is because greed, hatred, confusion, and so on are more prevalent in this buddhafield, not less.

source: ཆུང་ངུ་ནི་མ་ཡིན་ནོ། །དེ་ལྟ་བས་ན་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། དེ་ལས་གཞན་པའི་སྡིག་པ་ཤིན་ཏུ་མང་པོ་རྣམས་ཀྱང་སྤྱོད་དེ།
en: Therefore, beings engage in the ten unwholesome actions and very many wickednesses other than those as well.

source: དེའི་རྒྱུས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། {ཡི་དགས་,ཡི་དྭགས་}དང་། ལྷ་མ་ཡིན་གྱི་རིས་དང་། མི་རྣམས་ཀྱི་ནང་ན་སྡུག་བསྔལ་མང་བར་སྣང་ངོ་།
en: And those cause the appearance of beings in hell, as animals, as ghosts, in the class of asuras, and much suffering among humans as well.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དག་ནི་ཕལ་ཆེར་དེ་ལྟ་མ་ཡིན་ནོ། །བསྐལ་པ་ཡང་ངན་པ་ཉིད་དེ། མུ་གེའི་བསྐལ་པ་བར་མའི་དབང་གིས་བར་བར་དུ་མུ་གེའི་སྡུག་བསྔལ་བརྣགས་མི་ནུས་པ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་།
en: Usually buddhafields are not like that.

source: །ནད་ཀྱི་བསྐལ་པ་བར་མའི་དབང་གིས་ནད་མང་པོ་འབྱུང་ངོ་། །མཚོན་གྱི་བསྐལ་པ་བར་མའི་དབང་གིས་གཅིག་ལ་གཅིག་འཚེ་བ་མང་པོ་འབྱུང་ངོ་། །ཆུས་འཇིག་པའི་དབང་གིས་སྲིད་པའི་ཕྱོགས་ཀྱི་ཉོན་མོངས་པ་ཤས་ཆེར་གྱུར་པ་དང་། མེས་འཇིག་པའི་དབང་གིས་ཞེ་སྡང་གི་ཕྱོགས་ཤས་ཆེ་བ་དང་། རླུང་གིས་འཇིག་པའི་དབང་གིས་གཏི་མུག་གི་ཕྱོགས་ཤས་ཆེ་བ་ལ་སོགས་པ་དུས་ཀྱི་ཉེས་པ་མང་དུ་འབྱུང་ངོ་།
en: The time of the eon is also bad; many difficulties come about because of the time: the famine sub-eon’s force brings about a world with the excruciating suffering of recurrent famine; the sickness sub-eon’s force brings about many diseases; the armament sub-eon’s force brings about many who are violent toward one another; the force of the time during an eon when there is destruction by water makes afflictions on the side of suffering existence strong; the force of destruction by fire makes the hatred side strong; and the force of destruction by wind makes the confusion side strong, and so on.

source: །ཚེའི་སྙིགས་མ་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཚེ་ལ་ངེས་པ་མེད་དེ།
en: Degeneration in lifespan makes it uncertain how long beings live.

source: བར་བར་ན་ཚེའི་ཚད་དཔག་ཏུ་མེད། བར་བར་ནི་ཚེ་ལོ་བཅུ་བར་འགྱུར་ལ། དེ་ཡང་ངེས་པ་མེད་དེ། ཁ་ཅིག་ནི་མངལ་ཉིད་དུ་འཆི་བར་འགྱུར།
en: Sometimes the lifespan is immeasurable, sometimes the lifespan is for ten years—it is never definite.

source: ཁ་ཅིག་ནི་སྐྱེས་མ་ཐག་ཏུ་འམ་བྱིས་པའི་ཚེ་འམ། གཞོན་ནུའི་ཚེ་འམ། ལང་ཚོའི་ཚེ་འམ། དར་ལ་བབ་པའི་ཚེ་འམ། ན་ཕྱེད་ཟད་ཀྱི་ཚེ་འམ།
en: Some die in the womb, some right after birth or when still an infant, others in their teens, others in the prime of life, others when half their life is over, and others when they are old and so on.

source: རྒས་པ་ལ་སོགས་པ་ནས་འཆི་བའི་ངེས་པ་མེད་དེ། དེའི་དབང་གིས་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་ལ་སོགས་པ་མང་པོ་རྣམས་འཇིག་རྟེན་ན་ཡོད་པའི་ཕྱིར་རོ།
en: Death is uncertain, and on account of that there is much pain, lamentation, suffering, mental anguish, and so on in the world.

source: །ལྟ་བའི་སྙིགས་མ་ཡང་དགེ་བ་ཐམས་ཅད་འཇོམས་པར་བྱེད་པའི་ལྟ་བ་ཤིན་ཏུ་ངན་པ་སོ་སོར་དབྱེ་བས་ཕྱེ་ན་དྲུག་ཅུ་རྩ་གཉིས་ཡོད་དོ།
en: Degeneration in views is that extremely vile views destroy all that is wholesome. When subdivided there are the sixty-two of them.

source: །དེ་ལ་ལོག་པར་ལྟ་བ་ལ་ངེས་པར་ཞུགས་པ་ནི་སངས་རྒྱས་སྟོང་གིས་ཀྱང་གསོ་བར་མི་སྤྱོད་དོ། །ཡོངས་ཀྱང་མུ་སྟེགས་ཅན་ཐམས་ཅད་ནི་སྐུར་པ་འདེབས་པའི་ངང་ཚུལ་ཅན་དང་མ་དད་པ།
en: There, even a thousand buddhas do not engage in curing those who have become confirmed in wrong views.
